---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SlabShapeVertex Properties
SlabShapeVertex Class See Also Send Feedback
---

The SlabShapeVertex type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Position | The position of the vertex. |
|  | VertexType | The type of the vertex. |

# See Also

SlabShapeVertex Class

Autodesk.Revit.DB Namespace